interface Testimonial {
  id: number;
  name: string;
  text: string;
  currentCount: number;
  courseName: string;
}

export const testimonials: Testimonial[] = [
  {
    id: 1,
    name: "رضا احمدی",
    courseName: "دوره تریدینگ حرفه‌ای",
    text: "دوره تریدینگ حرفه‌ای اینجا واقعاً تغییر بزرگی در مسیر شغلی من ایجاد کرد. آموزش‌های حرفه‌ای و عملی باعث شد که به راحتی بتوانم استراتژی‌های موفقی را پیاده‌سازی کنم.",
    currentCount: 24,
  },
  {
    id: 2,
    name: "سارا نیک‌فر",
    courseName: "آموزش تحلیل تکنیکال",
    text: "با شرکت در دوره آموزش تحلیل تکنیکال، توانستم دانش و مهارت‌های خود را به‌طور قابل توجهی افزایش دهم. تحلیل‌های دقیق و ابزارهای کاربردی که آموزش داده شد، به من کمک کرد تا تصمیمات بهتری در بازار بگیرم.",
    currentCount: 26,
  },
  {
    id: 3,
    name: "مهدی رضایی",
    courseName: "استراتژی‌های معاملاتی پیشرفته",
    text: "دوره استراتژی‌های معاملاتی پیشرفته بسیار جامع و مفید بود. مطالب به‌روزی که ارائه شد، به من کمک کرد تا با اعتماد به نفس بیشتری در بازار فعالیت کنم و نتایج بهتری کسب کنم.",
    currentCount: 18,
  },

  {
    id: 4,
    name: "مینا جعفری",
    courseName: "تریدینگ و مدیریت ریسک",
    text: "آموزش‌های دوره تریدینگ و مدیریت ریسک به‌صورت کاربردی و عملی طراحی شده بود. تجربه یادگیری عالی و حمایت تیم آموزشی به من این امکان را داد که مهارت‌های خود را به‌طور چشمگیری ارتقا دهم.",
    currentCount: 59,
  },
];
